{
    "homePage": {
        "secondPage": {
            "moreAboutMeButtonText": "More Info",
            "aboutMeCardParagraph": "Lawyer, Doctor of Public Law, and lecturer in corporate law. My academic and professional background has allowed me to develop expertise in anti-corruption and compliance, with a particular focus on Arab countries, where these issues intertwine with major political and economic dimensions.",
            "aboutMeCardTitle": "About Me"
        },
        "thirdPage": {
            "moreExpertiseButtonText": "More Info",
            "expertiseCardParagraph": "Our Firm specialises in Immigration law and assiting non resident businesses. We help you get through the different steps and regulations imposed by the french government.",
            "expertiseCardTitle": "Expertises"
        },
        "fourthPage": {
            "morePublicationsButtonText": "More Info",
            "publicationsCardParagraph": "Our Firm specialises in Immigration law and assiting non resident businesses. We help you get through the different steps and regulations imposed by the french government.",
            "publicationsCardTitle": "Publications"
        }
    },
    "aboutMePage": {
        "title": "About Me",
        "paragraphOneContent": "Lawyer, Doctor of Public Law, and lecturer in corporate law. My academic and professional background has allowed me to develop expertise in anti-corruption and compliance, with a particular focus on Arab countries, where these issues intertwine with major political and economic dimensions.",
        "paragraphTwoContent": "Through my diverse experience in law firms, NGOs, and public administrations in France and abroad, I have developed a disciplined working approach grounded in responsiveness, active listening, and a multidisciplinary perspective on legal issues.",
        "paragraphThreeContent": "I have also developed expertise in immigration law, particularly since the Beirut port explosion, during which I was approached to assist many individuals with their procedures. At the same time, my passion for entrepreneurship has led me to support project leaders and business owners. Aware of the heavy workload and challenges they face, I aim to put my skills at their service to help them anticipate and overcome these obstacles."
    },
    "areaOfExpertisePage": {
        "firstPageHeader": "Area Of Expertise",
        "tabsContent": {
            "immigrationTabTitle": "Immigration Law",
            "immigrationTabContent": "<h2>A – Immigration Law</h2><p>The firm assists individuals and businesses in all their procedures related to entering and residing in France.</p><ol><li><strong>Visas, Residence Permits, and Legalization of Stay</strong><ul><li>Applications and renewals of residence permits</li><li>Work authorization requests</li><li>Legalization of stay for undocumented immigrants (traditional procedures and exceptional admission)</li><li>Assistance at the prefecture, preparation, and follow-up of applications</li><li>Legalization under “shortage occupations”</li><li>Change of status</li></ul></li><li><strong>Family and Private Life</strong><ul><li>Family reunification</li><li>“Visitor” visas for retirees and freelancers</li><li>Family visas</li><li>Spouses of French or EU nationals</li><li>Partners under a civil union (PACS)</li><li>Resident cards (10 years)</li></ul></li><li><strong>Support for all subcategories of the “Talent Passport” residence permit</strong><ul><li>Skilled employee</li><li>Recruitment in an innovative company</li><li>Highly qualified employment</li><li>Employee on assignment</li><li>Researcher</li><li>Business creation</li><li>Innovative project recognized by a public body</li><li>Investor</li><li>Corporate officer</li><li>Artistic and cultural profession</li><li>Person of international renown</li></ul></li><li><strong>Naturalization and Citizenship</strong><ul><li>Applications for naturalization / acquisition of French nationality</li><li>Appeals against postponement or rejection decisions in naturalization applications</li></ul></li><li><strong>Litigation and Appeals</strong><ul><li>Appeals against prefectural postponement/rejection decisions</li><li>Appeals against visa refusals</li></ul></li><li><strong>Consular Relations</strong><ul><li>Procedures with Consulates in France: obtaining certificates of custom, proof of name change, and drafting of legal opinions in family and inheritance law for states with Muslim or mixed legal systems (e.g., Lebanon).</li></ul></li><li><strong>Support for Foreign Entrepreneurs</strong><p>We support foreign entrepreneurs and investors in their business projects in France, whether to start an activity, expand an existing structure, or invest in the French economy. Personalized support is offered for your installation, with follow-up from your arrival in France (connections with chambers of commerce, specialized economic bodies).</p><p><strong>Our support includes:</strong></p><ul><li>Review of your project and guidance towards the most appropriate procedure (entrepreneur visa, Talent Passport, business creator or investor)</li><li>Full preparation of your file: drafting the business plan, financial justifications, proof of activity or investment</li><li>Submission of the application to the competent authorities (consulate or prefecture)</li><li>Monitoring of procedures and communication with relevant administrations (DREETS, Ministry of the Interior, prefectures)</li></ul></li></ol>",
            "businessTabTitle": "Business Law",
            "businessTabContent": "<h2>B – Business Law</h2><p>Starting a business in France as a non-resident is a tremendous opportunity: a dynamic market, attractive public support (such as the French Tech program), and a secure legal framework. However, the administrative, tax, and social processes can be complex.</p><p>We support you at every stage of your entrepreneurial project in France:</p><ul><li>Company formation (SAS, SARL, EURL, etc.)</li><li>Drafting and adaptation of bylaws</li><li>Company registration and administrative formalities</li><li>Assistance in anticipating the tax consequences of your establishment and optimizing your strategy to avoid double taxation under international treaties</li><li>Support for foreign entrepreneurs in their procedures from abroad, taking into account specific challenges related to compliance and anti-money laundering/combating the financing of terrorism</li></ul>"
        }
    },
    "publicationsPage": {
        "pageHeader": "Publications",
        "content": {
            "appointmentDifficultyPubPreviewTitle": "Difficulties in Getting an Appointment at the Prefecture",
            "appointmentDifficultyPubPreviewContent": "You need to contact the prefecture or sub-prefecture of your place of residence",
            "appointmentDifficultyPubContent": "<h2>Difficulties in Getting an Appointment at the Prefecture: What Are the Solutions?</h2><p>You need to contact the prefecture or sub-prefecture of your place of residence to submit a residence permit application, but the process seems complicated. You try to book an appointment online without success and may even consider using services that offer appointments at exorbitant prices, even though their activity is illegal.</p><p>Rest assured, you are not alone in this situation. In the Île-de-France region, this difficulty particularly affects several prefectures and sub-prefectures.</p><h3>What Possible Steps Can Be Taken?</h3><ol><li><strong>Write to the Prefecture</strong><p>You can inform the prefecture, by letter, of your inability to obtain an appointment and request a summons. However, this solution has its limits, as they may simply ask you to try again online.</p></li><li><strong>File an Urgent Administrative Court Action (Injunction)</strong><p>It is possible to ask the court to order the prefecture to provide you with a summons to submit your application. To do this, it is necessary to document your unsuccessful attempts (screenshots, follow-up emails sent to the prefecture, etc.).</p></li></ol><p>We can assist you in this procedure before the administrative court. We also provide comprehensive support: preparing the file, liaising with the prefecture, and following up on the process until the administration’s final decision.</p>"
        },
        "readMore": "Read more",
        "publicationGoBackButton": "Go back",
        "visaPassportHelp": "Visa / Passport",
        "immigration": "Immigration",
        "companies": "Companies"
    },
    "contactPage": {
        "submitButtonText": "SUBMIT",
        "submitSuccessMessage": "Email Sent!",
        "submitFailureMessage": "Something went wrong. Please retry after some time.",
        "submitBadFormMessage": "Please follow the form guidelines.",
        "formFirstNameFieldLabel": "First Name",
        "formFirstNameFieldPlaceholder": "Enter your first name",
        "formLastNameFieldLabel": "Last Name",
        "formLastNameFieldPlaceholder": "Enter your last name",
        "formEmailFieldLabel": "Email",
        "formEmailFieldPlaceholder": "Enter your email address",
        "formPhoneNumberFieldLabel": "Phone Number",
        "formPhoneNumberFieldPlaceholder": "Enter your phone number",
        "formMessageFieldLabel": "Message",
        "formMessageFieldPlaceholder": "Enter your message",
        "contactFormTitle": "We are all ears !"
    },
    "LocaleSwitcher": {
        "locale": "en"
    },
    "navbar": {
        "aboutMe": "About Me",
        "areaOfExpertise": "Area Of Expertise",
        "publications": "Publications",
        "contact": "Contact",
        "home": "Home"
    }
}